In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
        'A': [2.23, 3.45, 4.5, 6.0],
        'B': [1, 2, 3, 4],
        'C': ["test", "train", "test", "train"]
    })

In [3]:
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

In [4]:
df.shape  # Returns (number of rows, number of columns)

(4, 3)

In [5]:
df.dtypes

A    float64
B      int64
C     object
dtype: object

In [6]:
df.columns  # returns an index object

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df.columns.values # returns numpy array -> perhaps easier to manipulate

array(['A', 'B', 'C'], dtype=object)

In [8]:
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df.index.values

array([0, 1, 2, 3])

In [11]:
range(0, 5)

range(0, 5)

In [12]:
list(range(0,5))

[0, 1, 2, 3, 4]

In [13]:
len(list(range(0,5)))

5

In [14]:
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

In [15]:
df['A']

0    2.23
1    3.45
2    4.50
3    6.00
Name: A, dtype: float64

In [16]:
df['A'].values

array([2.23, 3.45, 4.5 , 6.  ])

In [17]:
df[['A','C']]

      A      C
0  2.23   test
1  3.45  train
2  4.50   test
3  6.00  train

In [18]:
df['A'].values[2]

4.5

In [19]:
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

In [20]:
df.iloc[1, 2]

'train'

In [21]:
type(df.iloc[1, 2])

str

In [22]:
df.iloc[1, :]

A     3.45
B        2
C    train
Name: 1, dtype: object

In [23]:
df.loc[1, 'B']

2

In [24]:
df.loc[1, 'C']

'train'

In [25]:
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

In [26]:
df.index = ['row 0', 'row 1', 'row 2', 'row 3']

In [27]:
df

          A  B      C
row 0  2.23  1   test
row 1  3.45  2  train
row 2  4.50  3   test
row 3  6.00  4  train

In [28]:
df.loc['row 1', 'C']

'train'

In [29]:
df['A'] + df['B']

row 0     3.23
row 1     5.45
row 2     7.50
row 3    10.00
dtype: float64

In [30]:
df['A'].values

array([2.23, 3.45, 4.5 , 6.  ])

In [31]:
df['B'].values

array([1, 2, 3, 4])

In [32]:
df['A'].values + df['B'].values

array([ 3.23,  5.45,  7.5 , 10.  ])

In [33]:
df['sum'] = df['A'].values + df['B'].values # adding a column

In [34]:
df

          A  B      C    sum
row 0  2.23  1   test   3.23
row 1  3.45  2  train   5.45
row 2  4.50  3   test   7.50
row 3  6.00  4  train  10.00

In [35]:
df.loc['row 4', :] = [1, 2, 3, 4]  # adding a row

In [36]:
df

          A    B      C    sum
row 0  2.23  1.0   test   3.23
row 1  3.45  2.0  train   5.45
row 2  4.50  3.0   test   7.50
row 3  6.00  4.0  train  10.00
row 4  1.00  2.0      3   4.00

In [37]:
df.sum()

A      17.18
B      12.00
sum    30.18
dtype: float64

In [38]:
df['A'].values.sum()

17.18

In [39]:
df.sum(axis=1)

row 0     6.46
row 1    10.90
row 2    15.00
row 3    20.00
row 4     7.00
dtype: float64

In [40]:
df.loc['row 0', ['A', 'B', 'sum']].values.sum()

6.46

In [41]:
a = list(range(0,1))

In [42]:
a.append(4)

In [43]:
a

[0, 4]

In [44]:
df.iloc[0, list(range(0,1)) + [3]]

A      2.23
sum    3.23
Name: row 0, dtype: object

In [45]:
list_a = [1,2,3]

In [46]:
list_a.append(4)

In [47]:
list_a

[1, 2, 3, 4]

In [48]:
col_numbers = list(range(len(df.columns)))
col_numbers

[0, 1, 2, 3]

In [49]:
df.columns

Index(['A', 'B', 'C', 'sum'], dtype='object')

In [50]:
len(df.columns)

4

In [51]:
list(range(0,4))

[0, 1, 2, 3]

In [52]:
col_numbers[:2]

[0, 1]

In [53]:
col_numbers[2:]

[2, 3]

In [54]:
col_numbers[:2] + col_numbers[3:]

[0, 1, 3]

In [55]:
df.iloc[:, col_numbers[:2] + col_numbers[3:]]

          A    B    sum
row 0  2.23  1.0   3.23
row 1  3.45  2.0   5.45
row 2  4.50  3.0   7.50
row 3  6.00  4.0  10.00
row 4  1.00  2.0   4.00